q='''инструктор(ы=а) 0
редактор(ы=а) 0
лектор(ы=а) 0
ректор(ы=а) 0
конструктор(ы=а) 0
прожектор(ы=а) 0
сектор(ы=а) 0
инженер(ы=а) 0
шофёр(ы=а) 0
бухгалтер(ы=а) 0
диспетчер(ы=а) 0
договор(ы=а) 0
приговор(ы=а) 0
плейер(ы=а) 0
драйвер(ы=а) 0
принтер(ы=а) 0
директор(а=ы) 0
профессор(а=ы) 0
инспектор(а=ы) 0
доктор(а=ы) 0
катер(а=ы) 0
ордер(а=ы) 0
тенор(а=ы) 0
фельдшер(а=ы) 0
флюгер(а=ы) 0
хутор(а=ы) 0
шулер(а=ы) 0
буфер(а=ы) 0
веер(а=ы) 0
буер(а=ы) 0
повар(а=ы) 0
грифел(и=я) 0
госпитал(и=я) 0
вексел(я=и) 0
вензел(я=и) 0
кител(я=и) 0
штабел(я=и) 0
штемпел(я=и) 0
топол(я=и) 0
шомпол(а=ы) 0
колокол(а=ы) 0
купол(а=ы) 0
слесар(и=я) 0
токар(и=я) 0
конюх(и=а) 0
возраст(ы=а) 0
крем(ы=а) 0
суп(ы=а) 0
грунт(ы=а) 0
лифт(ы=а) 0
порт(ы=а) 0
склад(ы=а) 0
торт(ы=а) 0
флот(ы=а) 0
фронт(ы=а) 0
штаб(ы=а) 0
штурман(ы=а) 0
адрес(а=ы) 0
бок(а=и) 0
борт(а=ы) 0
век(а=и) 0
желоб(а=ы) 0
жемчуг(а=и) 0
жернов(а=ы) 0
кра(я=и) 0
кузов(а=ы) 0
окорок(а=и) 0
округ(а=и) 0
остров(а=ы) 0
отпуск(а=и) 0
парус(а=ы) 0
паспорт(а=ы) 0
погреб(а=ы) 0
потрох(а=и) 0
снег(а=и) 0
стог(а=и) 0
сорт(а=ы) 0
сторож(а=и) 0
тетерев(а=ы) 0
череп(а=ы) 0
апельсин(ов=) 0
банан(ов=) 0
огурц(ов=) 0
томат(ов=) 0
помидор(ов=) 0
гранат(ов=) 0
абрикос(ов=) 0
ананас(ов=) 0
лимон(ов=) 0
мандарин(ов=) 0
баклажан(ов=) 0
яблок(=ов) 0
груш(=ей) 0
слив(=ов) 0
дын(ь=ей) 0
казах(ов=) 0
калмык(ов=) 0
киргиз(ов=) 0
монгол(ов=) 0
семит(ов=) 0
таджик(ов=) 0
тунгус(ов=) 0
узбек(ов=) 0
хорват(ов=) 0
якут(ов=) 0
тур(ок=ков) 0
бурят(=ов) 0
армян(=ов) 0
башкир(=ов) 0
болгар(=ов) 0
грузин(=ов) 0
лезгин(=ов) 0
осетин(=ов) 0
румын(=ов) 0
татар(=ов) 0
туркмен(=ов) 0
цыган(=ов) 0
бедуин(ов=) 0
байт(ов=) 0
гектар(ов=) 0
грамм(ов=) 0
децибел(ов=) 0
карат(ов=) 0
килограмм(ов=) 0
километр(ов=) 0
ампер(=ов) 0
аршин(=ов) 0
бит(=ов) 0
ватт(=ов) 0
вольт(=ов) 0
радиан(=ов) 0
рентген(=ов) 0
гольф(ов=) 0
рельс(ов=) 0
бронх(ов=) 0
джинс(ов=) 0
лампас(ов=) 0
бридж(ей=) 0
ботин(ок=ков) 0
чул(ок=ков) 0
шаровар(=ов) 0
шорт(=ов) 0
туф(ель=лей) 0
сапог(=ов) 0
тап(ок=ков) 0
тапоч(ек=ков) 0
галош(=ей) 0
бахил(=ов) 0
бутс(=ов) 0
вален(ок=ков) 0
манжет(=ов) 0
клипс(=ов) 0
солдат(=ов) 0
гусар(=ов) 0
драгун(=ов) 0
гренадёр(=ов) 0
кадет(=ов) 0
улан(=ов) 0
партизан(=ов) 0
богин(ь=) 0
погон(ь=) 0
тихон(ь=) 0
яблон(ь=) 0
нян(ь=) 0
басен(=ь) 0
башен(=ь) 0
боен(=ь) 0
вишен(=ь) 0
двоен(=ь) 0
пашен(=ь) 0
сотен(=ь) 0
спален(=ь) 0
сплетен(=ь) 0
таможен(=ь) 0
черешен(=ь) 0
барышен(ь=) 0
боярышен(ь=) 0
кухон(ь=) 0
дерев(ень=ней) 0
болот(цев=ец) 0
кружев(цев=ец) 0
дерев(цев=ец) 0
окон(цев=ец) 0
блюд(ец=цев) 0
зеркал(ец=ьцев) 0
одеял(ец=ьцев) 0
полотен(ец=цев) 0
серд(ец=цев) 0
солнц(=ев) 0
гулян(ий=ей=ьев) 0
арм(ий=ей=ьев) 0
застол(ий=ей=ьев) 0
аудитор(ий=ей=ьев) 0
кушан(ий=ей=ьев) 0
бегун(ий=ей=ьев) 0
надгроб(ий=ей=ьев) 0
гост(ий=ей=ьев) 0
новосел(ий=ей=ьев) 0
олад(ий=ей=ьев) 0
ожерел(ий=ей=ьев) 0
парод(ий=ей=ьев) 0
раздум(ий=ей=ьев) 0
плясун(ий=ей=ьев) 0
сиден(ий=ей=ьев) 0
эскадрил(ий=ей=ьев) 0
колдун(ий=ей=ьев) 0
печен(ий=ей=ьев) 0
снадоб(ий=ей=ьев) 0
побереж(ий=ей=ьев) 0
солен(ий=ей=ьев) 0
подземел(ий=ей=ьев) 0
ущел(ий=ей=ьев) 0
руж(ей=ий=ьев) 0
пит(ей=ий=ьев) 0
полын(ей=ий=ьев) 0
стат(ей=ий=ьев) 0
суд(ей=ий=ьев) 0
плат(ьев=ей=ий) 0
верхов(ьев=ей=ий) 0
корен(ьев=ей=ий) 0
лохмот(ьев=ей=ий) 0
низов(ьев=ей=ий) 0
подмастер(ьев=ей=ий) 0
хлоп(ьев=ей=ий) 0
уст(ьев=ей=ий) 0
распр(ей=ь=ий) 0
дров(ней=ень=ний) 0
ведомос(тей=тий) 0
коз(ней=ень=ний) 0
лопас(тей=тий) 0
пельмен(ей=ь=ий) 0
мощнос(тей=тий) 0
яс(лей=ель=лий) 0
отрас(лей=ель=лий) 0
скатерт(ей=ий) 0
скорост(ей=ий) 0
четверт(ей=ий) 0
бомж(ей=ий) 0
вексел(ей=ь=ий) 0
зел(ей=ь=ий) 0
госпитал(ей=ь=ий=ен) 0
кабел(ей=ий=ев) 0
медвед(ей=ев=ий) 0
буд(ней=ний=ен=ь) 0
раздум(ий=ьев=ей) 0
олад(ий=ьев=ей=ь) 0
сиден(ий=ьев=ей=ь) 0
солен(ий=ьев=ей=ь) 0
ущел(ий=ьев=ей=ь) 0
печен(ий=ьев=ей=ь) 0
кушан(ий=ьев=ей) 0
побереж(ий=ьев=ей) 0
ожерел(ий=ьев=ей=ь) 0
подземел(ий=ьев=ей=ь) 0
ваф(ель=лей=лий=ль) 0
пет(ель=лей=лий=ль) 0
полотен(ец=цев=иц=ц) 0
бар(ж=еж=жей=жь=жев=жий) 0
бас(ен=ень=ний=ней=нь=н) 0
баш(ен=еньъний=ней=нь=н) 0
блюд(ец=цев=ц) 0
брыз(г=гов=ог) 0
коп(ен=ней=н=ень=нь) 0
кочер(ег=гей=г=ыг=гов) 0
обо(йм=ем=ймов) 0
пелен(=ей=ов=ев) 0
каникул(=ов=ей) 0
лосин(=ов) 0
макарон(=ов) 0
манжет(=ов) 0
невзгод(=ов=ий=ей) 0
ок(ов=овий=овьев=) 0
сардин(=ов=ий) 0
уз(=ов) 0
шпрот(=ов) 0
брыз(г=гов=ог) 0
нян(ь=ей) 0
сер(ег=ьгов=г) 0
сирот(=ьев=ий) 0
сплет(ен=ней=ень=нь) 0
зраз(=ов) 0
жабр(=ов) 0
выбор(ов=ьев) 0
дебат(ов=) 0
замороз(ков=ок) 0
кулуар(ов=) 0
мускул(ов=) 0
нард(ов=) 0
очист(ков=ок=к) 0
сот(ов=) 0
чипс(ов=) 0
нерв(ов=) 0'''.split('\n')
exec(open('/home/gera/.pythonrc').read())
q=[w.split() for w in q]
q=[[int(w[1]),w[0]] for w in q]
def weighted_random(pairs):
    total = sum(pair[0] for pair in pairs)
    r = random()*(total-1)+1
    for (weight, value) in pairs:
        r -= weight
        if r <= 0: return [weight,value]
while 1:
 w=weighted_random(q)
 o,w=w,w[1]
 w=w[:-1].split('(')
 w[1]=w[1].split('=')
 w=[w[0]+e for e in w[1]]
 r,w=w[0],w[1:]
 if not(w):
  print('--',r)
 a=[]
 while a==[]:
  a=[e for e in w if randint(0,1)]
 a+=[r]
 shuffle(a)
 print(a)
 d=1
 t=time()
 z=int(input())-1
 while not (z<len(a) and a[z]==r):
  d=0
  t-=2
  z=int(input())-1
 t=time()-t
 p=o[:]
 p[0]=int((t/1.5)**7)
 q[q.index(o)]=p[:]
 s='\n'.join([w[1]+' '+str(w[0]) for w in q])
 x=open(argv[0]).read().split("'''")#'''
 x[1]=s
 x="'''".join(x)#'''
 open(argv[0],'w').write(x)
