q='''инструктор(ы=а) 987654321
редактор(ы=а) 987654321
лектор(ы=а) 987654321
ректор(ы=а) 987654321
конструктор(ы=а) 987654321
прожектор(ы=а) 987654321
сектор(ы=а) 987654321
инженер(ы=а) 987654321
шофёр(ы=а) 987654321
бухгалтер(ы=а) 987654321
диспетчер(ы=а) 987654321
договор(ы=а) 987654321
приговор(ы=а) 987654321
плейер(ы=а) 987654321
драйвер(ы=а) 987654321
принтер(ы=а) 987654321
директор(а=ы) 987654321
профессор(а=ы) 987654321
инспектор(а=ы) 987654321
доктор(а=ы) 987654321
катер(а=ы) 987654321
ордер(а=ы) 987654321
тенор(а=ы) 987654321
фельдшер(а=ы) 987654321
флюгер(а=ы) 987654321
хутор(а=ы) 987654321
шулер(а=ы) 987654321
буфер(а=ы) 987654321
веер(а=ы) 987654321
буер(а=ы) 987654321
повар(а=ы) 987654321
грифел(и=я) 987654321
госпитал(и=я) 987654321
вексел(я=и) 987654321
вензел(я=и) 987654321
кител(я=и) 987654321
штабел(я=и) 987654321
штемпел(я=и) 987654321
топол(я=и) 987654321
шомпол(а=ы) 987654321
колокол(а=ы) 987654321
купол(а=ы) 987654321
слесар(и=я) 987654321
токар(и=я) 987654321
конюх(и=а) 987654321
возраст(ы=а) 987654321
крем(ы=а) 987654321
суп(ы=а) 987654321
грунт(ы=а) 987654321
лифт(ы=а) 987654321
порт(ы=а) 987654321
склад(ы=а) 987654321
торт(ы=а) 987654321
флот(ы=а) 987654321
фронт(ы=а) 987654321
штаб(ы=а) 987654321
штурман(ы=а) 987654321
адрес(а=ы) 987654321
бок(а=и) 987654321
борт(а=ы) 987654321
век(а=и) 987654321
желоб(а=ы) 987654321
жемчуг(а=и) 987654321
жернов(а=ы) 987654321
кра(я=и) 987654321
кузов(а=ы) 987654321
окорок(а=и) 987654321
округ(а=и) 987654321
остров(а=ы) 987654321
отпуск(а=и) 987654321
парус(а=ы) 987654321
паспорт(а=ы) 987654321
погреб(а=ы) 987654321
потрох(а=и) 987654321
снег(а=и) 987654321
стог(а=и) 987654321
сорт(а=ы) 987654321
сторож(а=и) 987654321
тетерев(а=ы) 987654321
череп(а=ы) 987654321
апельсин(ов=) 987654321
банан(ов=) 987654321
огурц(ов=) 987654321
томат(ов=) 987654321
помидор(ов=) 987654321
гранат(ов=) 987654321
абрикос(ов=) 987654321
ананас(ов=) 987654321
лимон(ов=) 987654321
мандарин(ов=) 987654321
баклажан(ов=) 987654321
яблок(=ов) 987654321
груш(=ей) 987654321
слив(=ов) 987654321
дын(ь=ей) 987654321
казах(ов=) 987654321
калмык(ов=) 987654321
киргиз(ов=) 987654321
монгол(ов=) 987654321
семит(ов=) 987654321
таджик(ов=) 987654321
тунгус(ов=) 987654321
узбек(ов=) 987654321
хорват(ов=) 987654321
якут(ов=) 987654321
тур(ок=ков) 987654321
бурят(=ов) 987654321
армян(=ов) 987654321
башкир(=ов) 987654321
болгар(=ов) 987654321
грузин(=ов) 987654321
лезгин(=ов) 987654321
осетин(=ов) 987654321
румын(=ов) 987654321
татар(=ов) 987654321
туркмен(=ов) 987654321
цыган(=ов) 987654321
бедуин(ов=) 987654321
байт(ов=) 987654321
гектар(ов=) 987654321
грамм(ов=) 987654321
децибел(ов=) 987654321
карат(ов=) 987654321
килограмм(ов=) 987654321
километр(ов=) 987654321
ампер(=ов) 987654321
аршин(=ов) 987654321
бит(=ов) 987654321
ватт(=ов) 987654321
вольт(=ов) 987654321
радиан(=ов) 987654321
рентген(=ов) 987654321
гольф(ов=) 987654321
рельс(ов=) 987654321
бронх(ов=) 987654321
джинс(ов=) 987654321
лампас(ов=) 987654321
бридж(ей=) 987654321
ботин(ок=ков) 987654321
чул(ок=ков) 987654321
шаровар(=ов) 987654321
шорт(=ов) 987654321
туф(ель=лей) 987654321
сапог(=ов) 987654321
тап(ок=ков) 987654321
тапоч(ек=ков) 987654321
галош(=ей) 987654321
бахил(=ов) 987654321
бутс(=ов) 987654321
вален(ок=ков) 987654321
манжет(=ов) 987654321
клипс(=ов) 987654321
солдат(=ов) 987654321
гусар(=ов) 987654321
драгун(=ов) 987654321
гренадёр(=ов) 987654321
кадет(=ов) 987654321
улан(=ов) 987654321
партизан(=ов) 987654321
богин(ь=) 987654321
погон(ь=) 987654321
тихон(ь=) 987654321
яблон(ь=) 987654321
нян(ь=) 987654321
басен(=ь) 987654321
башен(=ь) 987654321
боен(=ь) 987654321
вишен(=ь) 987654321
двоен(=ь) 987654321
пашен(=ь) 987654321
сотен(=ь) 987654321
спален(=ь) 987654321
сплетен(=ь) 987654321
таможен(=ь) 987654321
черешен(=ь) 987654321
барышен(ь=) 987654321
боярышен(ь=) 987654321
кухон(ь=) 987654321
дерев(ень=ней) 987654321
болот(цев=ец) 987654321
кружев(цев=ец) 987654321
дерев(цев=ец) 987654321
окон(цев=ец) 987654321
блюд(ец=цев) 987654321
зеркал(ец=ьцев) 987654321
одеял(ец=ьцев) 987654321
полотен(ец=цев) 987654321
серд(ец=цев) 987654321
солнц(=ев) 987654321
гулян(ий=ей=ьев) 987654321
арм(ий=ей=ьев) 987654321
застол(ий=ей=ьев) 987654321
аудитор(ий=ей=ьев) 987654321
кушан(ий=ей=ьев) 987654321
бегун(ий=ей=ьев) 987654321
надгроб(ий=ей=ьев) 987654321
гост(ий=ей=ьев) 987654321
новосел(ий=ей=ьев) 987654321
олад(ий=ей=ьев) 987654321
ожерел(ий=ей=ьев) 987654321
парод(ий=ей=ьев) 987654321
раздум(ий=ей=ьев) 987654321
плясун(ий=ей=ьев) 987654321
сиден(ий=ей=ьев) 987654321
эскадрил(ий=ей=ьев) 987654321
колдун(ий=ей=ьев) 987654321
печен(ий=ей=ьев) 987654321
снадоб(ий=ей=ьев) 987654321
побереж(ий=ей=ьев) 987654321
солен(ий=ей=ьев) 987654321
подземел(ий=ей=ьев) 987654321
ущел(ий=ей=ьев) 987654321
руж(ей=ий=ьев) 987654321
пит(ей=ий=ьев) 987654321
полын(ей=ий=ьев) 987654321
стат(ей=ий=ьев) 987654321
суд(ей=ий=ьев) 987654321
плат(ьев=ей=ий) 987654321
верхов(ьев=ей=ий) 987654321
корен(ьев=ей=ий) 987654321
лохмот(ьев=ей=ий) 987654321
низов(ьев=ей=ий) 987654321
подмастер(ьев=ей=ий) 987654321
хлоп(ьев=ей=ий) 987654321
уст(ьев=ей=ий) 987654321
распр(ей=ь=ий) 987654321
дров(ней=ень=ний) 987654321
ведомос(тей=тий) 987654321
коз(ней=ень=ний) 987654321
лопас(тей=тий) 987654321
пельмен(ей=ь=ий) 987654321
мощнос(тей=тий) 987654321
яс(лей=ель=лий) 987654321
отрас(лей=ель=лий) 987654321
скатерт(ей=ий) 987654321
скорост(ей=ий) 987654321
четверт(ей=ий) 987654321
бомж(ей=ий) 987654321
вексел(ей=ь=ий) 987654321
зел(ей=ь=ий) 987654321
госпитал(ей=ь=ий=ен) 987654321
кабел(ей=ий=ев) 987654321
медвед(ей=ев=ий) 987654321
буд(ней=ний=ен=ь) 987654321
раздум(ий=ьев=ей) 987654321
олад(ий=ьев=ей=ь) 987654321
сиден(ий=ьев=ей=ь) 987654321
солен(ий=ьев=ей=ь) 987654321
ущел(ий=ьев=ей=ь) 987654321
печен(ий=ьев=ей=ь) 987654321
кушан(ий=ьев=ей) 987654321
побереж(ий=ьев=ей) 987654321
ожерел(ий=ьев=ей=ь) 987654321
подземел(ий=ьев=ей=ь) 987654321
ваф(ель=лей=лий=ль) 987654321
пет(ель=лей=лий=ль) 987654321
полотен(ец=цев=иц=ц) 987654321
бар(ж=еж=жей=жь=жев=жий) 987654321
бас(ен=ень=ний=ней=нь=н) 987654321
баш(ен=еньъний=ней=нь=н) 987654321
блюд(ец=цев=ц) 987654321
брыз(г=гов=ог) 987654321
коп(ен=ней=н=ень=нь) 987654321
кочер(ег=гей=г=ыг=гов) 987654321
обо(йм=ем=ймов) 987654321
пелен(=ей=ов=ев) 987654321
каникул(=ов=ей) 987654321
лосин(=ов) 987654321
макарон(=ов) 987654321
манжет(=ов) 987654321
невзгод(=ов=ий=ей) 987654321
ок(ов=овий=овьев=) 987654321
сардин(=ов=ий) 987654321
уз(=ов) 987654321
шпрот(=ов) 987654321
брыз(г=гов=ог) 987654321
нян(ь=ей) 987654321
сер(ег=ьгов=г) 987654321
сирот(=ьев=ий) 987654321
сплет(ен=ней=ень=нь) 987654321
зраз(=ов) 987654321
жабр(=ов) 987654321
выбор(ов=ьев) 987654321
дебат(ов=) 987654321
замороз(ков=ок) 987654321
кулуар(ов=) 987654321
мускул(ов=) 987654321
нард(ов=) 987654321
очист(ков=ок=к) 987654321
сот(ов=) 987654321
чипс(ов=) 987654321
нерв(ов=) 987654321'''.split('\n')
exec(open('/home/gera/.pythonrc').read())
c=fraction(0)
n=0
q=[w.split() for w in q]
q=[[int(w[1]),w[0]] for w in q]
def weighted_random(pairs):
    total = sum(pair[0] for pair in pairs)
    r = random()*total+1
    for (weight, value) in pairs:
        r -= weight
        if r <= 0: return [weight,value]
while 1:
 w=weighted_random(q)
 o,w=w,w[1]
 w=w[:-1].split('(')
 w[1]=w[1].split('=')
 w=[w[0]+e for e in w[1]]
 r,w=w[0],w[1:]
 if not(w):
  print('--',r)
 a=[]
 while a==[]:
  a=[e for e in w if randint(0,1)]
 a+=[r]
 shuffle(a)
 print(a,c)
 d=1
 t=time()
 z=int(input())-1
 while not (z<len(a) and a[z]==r):
  d=0
  z=int(input())-1
 t=time()-t
 c=(c*n+d)/(n+1)
 n+=1
 o[0]=t
 q[q.index(o)]=o[:]
 s='\n'.join([w[1]+' '+str(w[0]) for w in q])
 x=open(argv[0]).read().split("'''")#'''
 x[1]=s
 x="'''".join(x)#'''
 open(argv[0],'w').write(x)
