еду в зимнюю школу в долгопрудном
я решаю все контесты будто умный
еду в зимнюю школу в долгопрудном
я решаю все контесты будто умный
это гера, я лучший прогер за последнюю тысячу лет
я лучше чем лхик петр умник бенку 
апладу твой батя и даже турист си + +
еду в зимнюю школу в долгопрудном
я решаю все контесты будто умный
еду в зимнюю школу в долгопрудном
я решаю все контесты будто умный
еду в зимнюю школу в долгопрудном
я решаю все контесты будто умный
еду в зимнюю школу в долгопрудном
я решаю все контесты будто умный
еду в зимнюю школу в долгопрудном
мне лень написать межнар но так то он не трудный
я решаю все контесты будто умный
я решаю все задачи
всем кидаю их в телегу
у меня 5 тыщ в кф
ты вообще там не зареган
я умнее била гейтса
ты глупее печенега
стерты кнопки на клавухе
я в ларьке купил шавуху
ты всё пишешь на питоне 
знай земля те пухом
еду в зимнюю школу в долгопрудном
ни трамвай ни метро не дойдут до туда
хочешь кодить как я
я бы так не думал
мой код нечитаем кто вообще его придумал
с ним все твои програмки
не стояли рядом
перенес ихвсех в дев нул
я люблю порядок
