		async function setItem(name,value) {
			return await aurlopen('localstorage/set/'+name+'/'+JSON.stringify(value))
		}

		async function getItem(name) {
			return await aurlopen('localstorage/get/'+name)
		}

		function len(q){
			return q.length
		}

		function removeAllChildNodes(parent) {
			while (parent.firstChild) {
				parent.removeChild(parent.firstChild);
			}
		}

		ic=console.log

		function t_urlopen_json(url,f){
			fetch(url).then((r)=>{r.json().then(f)})
		}

		function t_urlopen_text(url,f){
			fetch(url).then((r)=>{r.text().then(f)})
		}

		async function urlopen_json(url){
			return await((await(fetch(url))).json())
		}

		async function urlopen_text(url){
			return await((await(fetch(url))).json())
		}

		function sleep(s) {
			return new Promise(resolve => setTimeout(resolve, 1000*s));
		}

		let exd={"data":{"timelines":[{"timestep":"1h","endTime":"2022-07-08T23:00:00Z","startTime":"2022-07-04T11:00:00Z","intervals":[{"startTime":"2022-07-04T11:00:00Z","values":{"temperature":-53.9}},{"startTime":"2022-07-04T12:00:00Z","values":{"temperature":-53.68}},{"startTime":"2022-07-04T13:00:00Z","values":{"temperature":-53.61}},{"startTime":"2022-07-04T14:00:00Z","values":{"temperature":-53.83}},{"startTime":"2022-07-04T15:00:00Z","values":{"temperature":-54.03}},{"startTime":"2022-07-04T16:00:00Z","values":{"temperature":-54.14}},{"startTime":"2022-07-04T17:00:00Z","values":{"temperature":-54.37}},{"startTime":"2022-07-04T18:00:00Z","values":{"temperature":-54.48}},{"startTime":"2022-07-04T19:00:00Z","values":{"temperature":-54.44}},{"startTime":"2022-07-04T20:00:00Z","values":{"temperature":-54.31}},{"startTime":"2022-07-04T21:00:00Z","values":{"temperature":-54.29}},{"startTime":"2022-07-04T22:00:00Z","values":{"temperature":-54.33}},{"startTime":"2022-07-04T23:00:00Z","values":{"temperature":-54.52}},{"startTime":"2022-07-05T00:00:00Z","values":{"temperature":-54.66}},{"startTime":"2022-07-05T01:00:00Z","values":{"temperature":-54.74}},{"startTime":"2022-07-05T02:00:00Z","values":{"temperature":-54.75}},{"startTime":"2022-07-05T03:00:00Z","values":{"temperature":-54.86}},{"startTime":"2022-07-05T04:00:00Z","values":{"temperature":-54.98}},{"startTime":"2022-07-05T05:00:00Z","values":{"temperature":-55.15}},{"startTime":"2022-07-05T06:00:00Z","values":{"temperature":-55.3}},{"startTime":"2022-07-05T07:00:00Z","values":{"temperature":-55.45}},{"startTime":"2022-07-05T08:00:00Z","values":{"temperature":-55.56}},{"startTime":"2022-07-05T09:00:00Z","values":{"temperature":-55.64}},{"startTime":"2022-07-05T10:00:00Z","values":{"temperature":-55.59}},{"startTime":"2022-07-05T11:00:00Z","values":{"temperature":-55.52}},{"startTime":"2022-07-05T12:00:00Z","values":{"temperature":-55.57}},{"startTime":"2022-07-05T13:00:00Z","values":{"temperature":-55.56}},{"startTime":"2022-07-05T14:00:00Z","values":{"temperature":-55.43}},{"startTime":"2022-07-05T15:00:00Z","values":{"temperature":-55.37}},{"startTime":"2022-07-05T16:00:00Z","values":{"temperature":-55.01}},{"startTime":"2022-07-05T17:00:00Z","values":{"temperature":-55.13}},{"startTime":"2022-07-05T18:00:00Z","values":{"temperature":-55.15}},{"startTime":"2022-07-05T19:00:00Z","values":{"temperature":-55.23}},{"startTime":"2022-07-05T20:00:00Z","values":{"temperature":-55.37}},{"startTime":"2022-07-05T21:00:00Z","values":{"temperature":-55.38}},{"startTime":"2022-07-05T22:00:00Z","values":{"temperature":-55.44}},{"startTime":"2022-07-05T23:00:00Z","values":{"temperature":-55.56}},{"startTime":"2022-07-06T00:00:00Z","values":{"temperature":-55.53}},{"startTime":"2022-07-06T01:00:00Z","values":{"temperature":-55.57}},{"startTime":"2022-07-06T02:00:00Z","values":{"temperature":-54.87}},{"startTime":"2022-07-06T03:00:00Z","values":{"temperature":-55}},{"startTime":"2022-07-06T04:00:00Z","values":{"temperature":-54.95}},{"startTime":"2022-07-06T05:00:00Z","values":{"temperature":-54.36}},{"startTime":"2022-07-06T06:00:00Z","values":{"temperature":-53.86}},{"startTime":"2022-07-06T07:00:00Z","values":{"temperature":-53.84}},{"startTime":"2022-07-06T08:00:00Z","values":{"temperature":-54.02}},{"startTime":"2022-07-06T09:00:00Z","values":{"temperature":-54.48}},{"startTime":"2022-07-06T10:00:00Z","values":{"temperature":-54.96}},{"startTime":"2022-07-06T11:00:00Z","values":{"temperature":-55.7}},{"startTime":"2022-07-06T12:00:00Z","values":{"temperature":-55.89}},{"startTime":"2022-07-06T13:00:00Z","values":{"temperature":-55.69}},{"startTime":"2022-07-06T14:00:00Z","values":{"temperature":-54.89}},{"startTime":"2022-07-06T15:00:00Z","values":{"temperature":-53.73}},{"startTime":"2022-07-06T16:00:00Z","values":{"temperature":-53}},{"startTime":"2022-07-06T17:00:00Z","values":{"temperature":-52.98}},{"startTime":"2022-07-06T18:00:00Z","values":{"temperature":-52.55}},{"startTime":"2022-07-06T19:00:00Z","values":{"temperature":-51.89}},{"startTime":"2022-07-06T20:00:00Z","values":{"temperature":-49.91}},{"startTime":"2022-07-06T21:00:00Z","values":{"temperature":-49.15}},{"startTime":"2022-07-06T22:00:00Z","values":{"temperature":-49.03}},{"startTime":"2022-07-06T23:00:00Z","values":{"temperature":-48.48}},{"startTime":"2022-07-07T00:00:00Z","values":{"temperature":-50.19}},{"startTime":"2022-07-07T01:00:00Z","values":{"temperature":-49.53}},{"startTime":"2022-07-07T02:00:00Z","values":{"temperature":-48.86}},{"startTime":"2022-07-07T03:00:00Z","values":{"temperature":-47.92}},{"startTime":"2022-07-07T04:00:00Z","values":{"temperature":-47.21}},{"startTime":"2022-07-07T05:00:00Z","values":{"temperature":-46.62}},{"startTime":"2022-07-07T06:00:00Z","values":{"temperature":-46.03}},{"startTime":"2022-07-07T07:00:00Z","values":{"temperature":-45.45}},{"startTime":"2022-07-07T08:00:00Z","values":{"temperature":-45.04}},{"startTime":"2022-07-07T09:00:00Z","values":{"temperature":-44.51}},{"startTime":"2022-07-07T10:00:00Z","values":{"temperature":-44.1}},{"startTime":"2022-07-07T11:00:00Z","values":{"temperature":-43.84}},{"startTime":"2022-07-07T12:00:00Z","values":{"temperature":-42.81}},{"startTime":"2022-07-07T13:00:00Z","values":{"temperature":-42.19}},{"startTime":"2022-07-07T14:00:00Z","values":{"temperature":-41.96}},{"startTime":"2022-07-07T15:00:00Z","values":{"temperature":-41.24}},{"startTime":"2022-07-07T16:00:00Z","values":{"temperature":-40.58}},{"startTime":"2022-07-07T17:00:00Z","values":{"temperature":-40.16}},{"startTime":"2022-07-07T18:00:00Z","values":{"temperature":-39.73}},{"startTime":"2022-07-07T19:00:00Z","values":{"temperature":-39.43}},{"startTime":"2022-07-07T20:00:00Z","values":{"temperature":-39.7}},{"startTime":"2022-07-07T21:00:00Z","values":{"temperature":-39.43}},{"startTime":"2022-07-07T22:00:00Z","values":{"temperature":-39.12}},{"startTime":"2022-07-07T23:00:00Z","values":{"temperature":-38.53}},{"startTime":"2022-07-08T00:00:00Z","values":{"temperature":-38.05}},{"startTime":"2022-07-08T01:00:00Z","values":{"temperature":-43.32}},{"startTime":"2022-07-08T02:00:00Z","values":{"temperature":-42.25}},{"startTime":"2022-07-08T03:00:00Z","values":{"temperature":-41.3}},{"startTime":"2022-07-08T04:00:00Z","values":{"temperature":-40.6}},{"startTime":"2022-07-08T05:00:00Z","values":{"temperature":-39.82}},{"startTime":"2022-07-08T06:00:00Z","values":{"temperature":-39.22}},{"startTime":"2022-07-08T07:00:00Z","values":{"temperature":-38.42}},{"startTime":"2022-07-08T08:00:00Z","values":{"temperature":-37.7}},{"startTime":"2022-07-08T09:00:00Z","values":{"temperature":-37.02}},{"startTime":"2022-07-08T10:00:00Z","values":{"temperature":-36.98}},{"startTime":"2022-07-08T11:00:00Z","values":{"temperature":-36.7}},{"startTime":"2022-07-08T12:00:00Z","values":{"temperature":-36.58}},{"startTime":"2022-07-08T13:00:00Z","values":{"temperature":-36.57}},{"startTime":"2022-07-08T14:00:00Z","values":{"temperature":-36.84}},{"startTime":"2022-07-08T15:00:00Z","values":{"temperature":-36.94}},{"startTime":"2022-07-08T16:00:00Z","values":{"temperature":-38}},{"startTime":"2022-07-08T17:00:00Z","values":{"temperature":-38.35}},{"startTime":"2022-07-08T18:00:00Z","values":{"temperature":-41.14}},{"startTime":"2022-07-08T19:00:00Z","values":{"temperature":-43.96}},{"startTime":"2022-07-08T20:00:00Z","values":{"temperature":-43.21}},{"startTime":"2022-07-08T21:00:00Z","values":{"temperature":-40.77}},{"startTime":"2022-07-08T22:00:00Z","values":{"temperature":-40.3}},{"startTime":"2022-07-08T23:00:00Z","values":{"temperature":-40.7}}]}]}};

		async function get_data(){
			localstorage=window.localStorage;
			var g=localstorage['expd'];
			if (g){
				g=JSON.parse(g);
			}
			var t=Date.now() / 1000 | 0;
			if (!g || !g.data || g.time<t){
				g={}
				g.data=exd;
				// g.data=await urlopen_json("https://api.tomorrow.io/v4/timelines?location=58.59766760766661,49.65268871471847&fields=temperature,weatherCode&timesteps=1h&units=metric&apikey=N4w8rEcJIjuLa2N2ZtUQTLVgXtFr5gEn&timezone=Europe%2FMoscow");
				g.time=3*3600 + t;
			}
			localstorage['expd']=JSON.stringify(g);
			return g.data;
		}

		function parse_iso_8601(str){
			return [[
				str.slice(0,4),
				str.slice(5,7),
				str.slice(8,10),
				],[
				str.slice(11,13),
				str.slice(14,16),
				str.slice(17,19),]
			]
		}

		let a=exd.data.timelines[0].intervals;
		for (var w=0;w<a.length;++w){
			a[w].values.weatherCode=0;
		}

		async function main(){
			a=await get_data();
			a=a.data.timelines[0].intervals;
			var dt=document.getElementById('table');
			removeAllChildNodes(dt);
			dates={};
			for (var w=0;w<a.length;++w){
				dates[parse_iso_8601(a[w].startTime)[0]]=[];
			}
			for (var w=0;w<a.length;++w){
				dates[parse_iso_8601(a[w].startTime)[0]].push(a[w]);
			}
			for (var q in dates){
				a=dates[q];
				t=document.createElement('table');
				t.width='100%'
				t.border=1;
				t.style='font-size:400%';
				for (var w=0;w<a.length;++w){
					let z=document.createElement('td');
					z.innerText=parse_iso_8601(a[w].startTime)[1][0]+':00';
					let x=document.createElement('td');
					x.innerText=Math.round(a[w].values.temperature);
					let c=document.createElement('td');
					c.innerText=d[a[w].values.weatherCode];
					let v=document.createElement('tr');
					v.appendChild(z);
					v.appendChild(x);
					v.appendChild(c);
					t.appendChild(v);
				}
				h=document.createElement('h1');
				var qa=q.split(',');
				qa.reverse();
				h.innerText=qa.join('.');
				h.style='font-size:400%';
				dt.appendChild(h);
				dt.appendChild(t);
			}
		}
d=
{
	"0": "неизвестно",
	"1000": "чисто, солнечно",
	"1001": "облачно",
	"1100": "в основном чисто",
	"1101": "частично облачно",
	"1102": "в основном облачно",
	"1103": "частично облачно и в основном чисто",
	"2000": "туман",
	"2100": "лёгкий туман",
	"2101": "в основном чисто и лёгкий туман",
	"2102": "частично облачно и лёгкий туман",
	"2103": "в основном облачно и лёгкий туман",
	"2106": "в основном чисто и туман",
	"2107": "частично облачно и туман",
	"2108": "в основном облачно и туман",
	"4000": "морось",
	"4001": "дождь",
	"4200": "лёгкий дождь",
	"4201": "сильный дождь",
	"4202": "частично облачно и сильный дождь",
	"4203": "в основном чисто и морось",
	"4204": "частично облачно и морось",
	"4205": "в основном облачно и морось",
	"4208": "частично облачно и дождь",
	"4209": "в основном чисто и дождь",
	"4210": "в основном облачно и дождь",
	"4211": "в основном чисто и сильный дождь",
	"4212": "в основном облачно и сильный дождь",
	"4213": "в основном чисто и лёгкий дождь",
	"4214": "частично облачно и лёгкий дождь",
	"4215": "в основном облачно и лёгкий дождь",
	"5000": "снег",
	"5001": "ветренно",
	"5100": "лёгкий снег",
	"5101": "сильный снег",
	"5102": "в основном чисто и лёгкий снег",
	"5103": "частично облачно и лёгкий снег",
	"5104": "в основном облачно и лёгкий снег",
	"5105": "в основном чисто и снег",
	"5106": "частично облачно и снег",
	"5107": "в основном облачно и снег",
	"5108": "дождь и снег",
	"5110": "морось и снег",
	"5112": "снег и ледяная крупа",
	"5114": "снег и холодный дождь",
	"5115": "в основном чисто и ветренно",
	"5116": "частично облачно и ветренно",
	"5117": "в основном облачно и ветренно",
	"5119": "в основном чисто и сильный снег",
	"5120": "частично облачно и сильный снег",
	"5121": "в основном облачно и сильный снег",
	"5122": "морось и лёгкий снег",
	"6000": "холодный морось",
	"6001": "холодный дождь",
	"6002": "частично облачно и холодный морось",
	"6003": "в основном чисто и холодный морось",
	"6004": "в основном облачно и холодный морось",
	"6200": "лёгкий холодный дождь",
	"6201": "сильный холодный дождь",
	"6202": "частично облачно и сильный холодный дождь",
	"6203": "частично облачно и лёгкий холодный дождь",
	"6204": "морось и холодный морось",
	"6205": "в основном чисто и лёгкий холодный дождь",
	"6206": "лёгкий дождь и холодный морось",
	"6207": "в основном чисто и сильный холодный дождь",
	"6208": "в основном облачно и сильный холодный дождь",
	"6209": "в основном облачно и лёгкий холодный дождь",
	"6212": "морось и холодный дождь",
	"6213": "в основном чисто и холодный дождь",
	"6214": "частично облачно и холодный дождь",
	"6215": "в основном облачно и холодный дождь",
	"6220": "лёгкий дождь и холодный дождь",
	"6222": "дождь и холодный дождь",
	"7000": "ледяная крупа",
	"7101": "сильный ледяная крупа",
	"7102": "лёгкий ледяная крупа",
	"7103": "холодный дождь и сильный ледяная крупа",
	"7105": "морось и ледяная крупа",
	"7106": "холодный дождь и ледяная крупа",
	"7107": "частично облачно и ледяная крупа",
	"7108": "в основном чисто и ледяная крупа",
	"7109": "в основном облачно и ледяная крупа",
	"7110": "в основном чисто и лёгкий ледяная крупа",
	"7111": "частично облачно и лёгкий ледяная крупа",
	"7112": "в основном облачно и лёгкий ледяная крупа",
	"7113": "в основном чисто и сильный ледяная крупа",
	"7114": "частично облачно и сильный ледяная крупа",
	"7115": "лёгкий дождь и ледяная крупа",
	"7116": "в основном облачно и сильный ледяная крупа",
	"7117": "дождь и ледяная крупа",
	"8000": "гроза",
	"8001": "в основном чисто и гроза",
	"8002": "в основном облачно и гроза",
	"8003": "частично облачно и гроза",
	"10000": "чисто, солнечно",
	"10001": "чисто",
	"10010": "облачно",
	"10011": "облачно",
	"11000": "в основном чисто",
	"11001": "в основном чисто",
	"11010": "частично облачно",
	"11011": "частично облачно",
	"11020": "в основном облачно",
	"11021": "в основном облачно",
	"11030": "частично облачно и в основном чисто",
	"11031": "частично облачно и в основном чисто",
	"20000": "туман",
	"20001": "туман",
	"21000": "лёгкий туман",
	"21001": "лёгкий туман",
	"21010": "в основном чисто и лёгкий туман",
	"21011": "в основном чисто и лёгкий туман",
	"21020": "частично облачно и лёгкий туман",
	"21021": "частично облачно и лёгкий туман",
	"21030": "в основном облачно и лёгкий туман",
	"21031": "в основном облачно и лёгкий туман",
	"21060": "в основном чисто и туман",
	"21061": "в основном чисто и туман",
	"21070": "частично облачно и туман",
	"21071": "частично облачно и туман",
	"21080": "в основном облачно и туман",
	"21081": "в основном облачно и туман",
	"40000": "морось",
	"40001": "морось",
	"40010": "дождь",
	"40011": "дождь",
	"42000": "лёгкий дождь",
	"42001": "лёгкий дождь",
	"42010": "сильный дождь",
	"42011": "сильный дождь",
	"42020": "частично облачно и сильный дождь",
	"42021": "частично облачно и сильный дождь",
	"42030": "в основном чисто и морось",
	"42031": "в основном чисто и морось",
	"42040": "частично облачно и морось",
	"42041": "частично облачно и морось",
	"42050": "в основном облачно и морось",
	"42051": "в основном облачно и морось",
	"42080": "частично облачно и дождь",
	"42081": "частично облачно и дождь",
	"42090": "в основном чисто и дождь",
	"42091": "в основном чисто и дождь",
	"42100": "в основном облачно и дождь",
	"42101": "в основном облачно и дождь",
	"42110": "в основном чисто и сильный дождь",
	"42111": "в основном чисто и сильный дождь",
	"42120": "в основном облачно и сильный дождь",
	"42121": "в основном облачно и сильный дождь",
	"42130": "в основном чисто и лёгкий дождь",
	"42131": "в основном чисто и лёгкий дождь",
	"42140": "частично облачно и лёгкий дождь",
	"42141": "частично облачно и лёгкий дождь",
	"42150": "в основном облачно и лёгкий дождь",
	"42151": "в основном облачно и лёгкий дождь",
	"50000": "снег",
	"50001": "снег",
	"50010": "ветренно",
	"50011": "ветренно",
	"51000": "лёгкий снег",
	"51001": "лёгкий снег",
	"51010": "сильный снег",
	"51011": "сильный снег",
	"51020": "в основном чисто и лёгкий снег",
	"51021": "в основном чисто и лёгкий снег",
	"51030": "частично облачно и лёгкий снег",
	"51031": "частично облачно и лёгкий снег",
	"51040": "в основном облачно и лёгкий снег",
	"51041": "в основном облачно и лёгкий снег",
	"51050": "в основном чисто и снег",
	"51051": "в основном чисто и снег",
	"51060": "частично облачно и снег",
	"51061": "частично облачно и снег",
	"51070": "в основном облачно и снег",
	"51071": "в основном облачно и снег",
	"51080": "дождь и снег",
	"51081": "дождь и снег",
	"51100": "морось и снег",
	"51101": "морось и снег",
	"51120": "снег и ледяная крупа",
	"51121": "снег и ледяная крупа",
	"51140": "снег и холодный дождь",
	"51141": "снег и холодный дождь",
	"51150": "в основном чисто и ветренно",
	"51151": "в основном чисто и ветренно",
	"51160": "частично облачно и ветренно",
	"51161": "частично облачно и ветренно",
	"51170": "в основном облачно и ветренно",
	"51171": "в основном облачно и ветренно",
	"51190": "в основном чисто и сильный снег",
	"51191": "в основном чисто и сильный снег",
	"51200": "частично облачно и сильный снег",
	"51201": "частично облачно и сильный снег",
	"51210": "в основном облачно и сильный снег",
	"51211": "в основном облачно и сильный снег",
	"51220": "морось и лёгкий снег",
	"51221": "морось и лёгкий снег",
	"60000": "холодный морось",
	"60001": "холодный морось",
	"60010": "холодный дождь",
	"60011": "холодный дождь",
	"60020": "частично облачно и холодный морось",
	"60021": "частично облачно и холодный морось",
	"60030": "в основном чисто и холодный морось",
	"60031": "в основном чисто и холодный морось",
	"60040": "в основном облачно и холодный морось",
	"60041": "в основном облачно и холодный морось",
	"62000": "лёгкий холодный дождь",
	"62001": "лёгкий холодный дождь",
	"62010": "сильный холодный дождь",
	"62011": "сильный холодный дождь",
	"62020": "частично облачно и сильный холодный дождь",
	"62021": "частично облачно и сильный холодный дождь",
	"62030": "частично облачно и лёгкий холодный дождь",
	"62031": "частично облачно и лёгкий холодный дождь",
	"62040": "морось и холодный морось",
	"62041": "морось и холодный морось",
	"62050": "в основном чисто и лёгкий холодный дождь",
	"62051": "в основном чисто и лёгкий холодный дождь",
	"62060": "лёгкий дождь и холодный морось",
	"62061": "лёгкий дождь и холодный морось",
	"62070": "в основном чисто и сильный холодный дождь",
	"62071": "в основном чисто и сильный холодный дождь",
	"62080": "в основном облачно и сильный холодный дождь",
	"62081": "в основном облачно и сильный холодный дождь",
	"62090": "в основном облачно и лёгкий холодный дождь",
	"62091": "в основном облачно и лёгкий холодный дождь",
	"62120": "морось и холодный дождь",
	"62121": "морось и холодный дождь",
	"62130": "в основном чисто и холодный дождь",
	"62131": "в основном чисто и холодный дождь",
	"62140": "частично облачно и холодный дождь",
	"62141": "частично облачно и холодный дождь",
	"62150": "в основном облачно и холодный дождь",
	"62151": "в основном облачно и холодный дождь",
	"62200": "лёгкий дождь и холодный дождь",
	"62201": "лёгкий дождь и холодный дождь",
	"62220": "дождь и холодный дождь",
	"62221": "дождь и холодный дождь",
	"70000": "ледяная крупа",
	"70001": "ледяная крупа",
	"71010": "сильный ледяная крупа",
	"71011": "сильный ледяная крупа",
	"71020": "лёгкий ледяная крупа",
	"71021": "лёгкий ледяная крупа",
	"71030": "холодный дождь и сильный ледяная крупа",
	"71031": "холодный дождь и сильный ледяная крупа",
	"71050": "морось и ледяная крупа",
	"71051": "морось и ледяная крупа",
	"71060": "холодный дождь и ледяная крупа",
	"71061": "холодный дождь и ледяная крупа",
	"71070": "частично облачно и ледяная крупа",
	"71071": "частично облачно и ледяная крупа",
	"71080": "в основном чисто и ледяная крупа",
	"71081": "в основном чисто и ледяная крупа",
	"71090": "в основном облачно и ледяная крупа",
	"71091": "в основном облачно и ледяная крупа",
	"71100": "в основном чисто и лёгкий ледяная крупа",
	"71101": "в основном чисто и лёгкий ледяная крупа",
	"71110": "частично облачно и лёгкий ледяная крупа",
	"71111": "частично облачно и лёгкий ледяная крупа",
	"71120": "в основном облачно и лёгкий ледяная крупа",
	"71121": "в основном облачно и лёгкий ледяная крупа",
	"71130": "в основном чисто и сильный ледяная крупа",
	"71131": "в основном чисто и сильный ледяная крупа",
	"71140": "частично облачно и сильный ледяная крупа",
	"71141": "частично облачно и сильный ледяная крупа",
	"71150": "лёгкий дождь и ледяная крупа",
	"71151": "лёгкий дождь и ледяная крупа",
	"71160": "в основном облачно и сильный ледяная крупа",
	"71161": "в основном облачно и сильный ледяная крупа",
	"71170": "дождь и ледяная крупа",
	"71171": "дождь и ледяная крупа",
	"80000": "гроза",
	"80001": "гроза",
	"80010": "в основном чисто и гроза",
	"80011": "в основном чисто и гроза",
	"80020": "в основном облачно и гроза",
	"80021": "в основном облачно и гроза",
	"80030": "частично облачно и гроза",
	"80031": "частично облачно и гроза"
}


